Лабораторна робота №3
Тема роботи: Побудова моделі Дерева рішень 
Мета роботи: Формування навиків використання моделей машинного навчання

Хід роботи

1. Завантаження даних:

Використала housing.csv, у якому містяться дані про нерухомість.
Стовпець MEDV є цільовою змінною, яка відображає середню вартість нерухомості.

2. Розподіл даних:

X містить всі ознаки, за якими будемо робити прогнози.
y містить цільову змінну MEDV (середню вартість нерухомості).
Далі дані розділяються на навчальні та тестові.

3. Побудова дерева рішень:

Створюємо та тренуємо модель дерева рішень для регресії.

4. Прогнозування:

Прогнозуємо цільову змінну для тестових даних.

5. Оцінка моделі:

Визначаємо середньоквадратичну помилку (MSE) та коефіцієнт детермінації (R²).

6. Візуалізація дерева рішень:

Створюємо графік дерева рішень для наочності розподілу даних. "лабораторна_3.jpg" "лабораторна_3.1.jpg"