Звіт по виконаній лабораторній роботі №2

1. Завантаження даних:
   - Використовувався набір даних "advertising.csv", який містить дані про витрати на рекламу та продажі.
   - Датасет містить такі стовпці:
     - TV: витрати на телевізійну рекламу
     - Radio: витрати на радіо-рекламу
     - Newspaper: витрати на рекламу в газетах
     - Sales: кількість продажів

2. Стандартизація даних:
   - Для забезпечення однакового масштабу даних була застосована стандартизація. Усі числові значення (TV, Radio, Newspaper) були приведені до середнього значення 0 і стандартного відхилення 1.

3. Виконання кластеризації за допомогою алгоритму K-means:
   - Модель K-means була застосована для кластеризації даних на 3 кластери.
   - Мітки кластерів були додані до оригінальних даних.

4. Кількість зразків у кожному кластері:
   - Після виконання кластеризації, кількість зразків у кожному кластері була наступною:
   
   Кластери:
   - Кластер 0
   - Кластер 1
   - Кластер 2

5. Візуалізація результатів:
   - Для візуалізації кластеризації використано графік розсіювання, де вісь X — це витрати на телевізійну рекламу (TV), а вісь Y — витрати на радіо-рекламу (Radio).
   - Кожен зразок позначений кольором, що відповідає його кластеру.

6. Збереження графіка:
   - Графік кластеризації було збережено у файл "лабораторна_2.1.jpg", "лабораторна_2.jpg".


